Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Water supply risers from the shower valve to the shower head outlet, whether exposed or concealed, shall be attached to the structure.
fr_ca: Les colonnes montantes d'alimentation en eau allant de la vanne de douche à la sortie de la tête de mur de douche, qu'elles soient exposées ou dissimulées, doivent être fixées à la structure.

source: Water tanks supported directly on grade if the capacity is not greater than 5,000 gallons (18 925 L) and the ratio of height to diameter or width is not greater than 2:1.
fr_ca: Réservoirs d’eau reposant directement sur le sol, si leur capacité ne dépasse pas 5 000 gallons (18 925 L) et si le rapport entre la hauteur et le diamètre ou la largeur ne dépasse pas 2:1.

source: Wheelchair space locations shall be an integral part of any seating area.
fr_ca: Les emplacements des espaces pour fauteuils roulants doivent faire partie intégrante de toute aire de sièges.

source: Wheelchair space locations shall be dispersed at a variety of distances from the event to provide viewing options.
fr_ca: Les emplacements pour fauteuils roulants doivent être dispersés à différentes distances de l'événement pour offrir des options de visionnement.

source: Wheelchair space locations shall be dispersed horizontally to provide viewing options.
fr_ca: Les emplacements pour fauteuils roulants doivent être dispersés horizontalement pour offrir des options de vision.

source: Wheelchair space locations shall be dispersed in accordance with Sections 802.10.1, 802.10.2 and 802.10.3.
fr_ca: Les emplacements pour fauteuils roulants doivent être répartis selon les sections 802.10.1, 802.10.2 et 802.10.3.

source: Wheelchair space locations shall be located in accordance with one of the following:
fr_ca: Les emplacements pour fauteuils roulants doivent être situés conformément à l'une des conditions suivantes :

source: Wheelchair spaces and wheelchair space locations in assembly areas with spectator seating shall comply with Section 802.
fr_ca: Les espaces pour fauteuils roulants et l'emplacement des espaces pour fauteuils roulants dans les aires de rassemblement avec des sièges pour spectateurs doivent être conformes à la section 802.

source: Wheelchair spaces required to provide a line of sight over standing spectators shall comply with Section 802.9.2.
fr_ca: Les espaces pour fauteuils roulants devant offrir une ligne de vue au-dessus des spectateurs debout doivent être conformes à la section 802.9.2.

source: Wheelchair spaces shall adjoin an accessible route.
fr_ca: Les espaces pour fauteuils roulants doivent être adjacents à un itinéraire accessible.

source: When determining distance from receptacles, the distance shall be measured as the shortest path the cord of an appliance connected to the receptacle would follow without piercing a floor, wall, ceiling, or fixed barrier, or passing through a door, doorway or window.
fr_ca: Lors de la détermination de la distance par rapport aux prises, la distance doit être mesurée comme le chemin le plus court que suivrait le cordon d'un appareil branché sur la prise sans percer un plancher, un mur, un plafond ou une barrière fixe, ni passer par une porte, une ouverture de porte ou une fenêtre.

source: When the approach to the water closet is from the side, the 18 inches (455 mm) minimum shall be on the side opposite the direction of approach.
fr_ca: Lorsque l'approche de la cabine de toilette se fait par le côté, le minimum de 18 po [455 mm] doit être du côté opposé à la direction d'approche.

source: When the building official issues a permit, the construction documents shall be approved, in writing or by stamp, as “Reviewed for Code Compliance.”
fr_ca: Lorsque le responsable de la construction délivre un permis, les documents de construction doivent être approuvés, par écrit ou au moyen d’un cachet, avec la mention « Examinés pour conformité au code ».

source: Where .stairways and stepped aisles are in a straight run, transitions shall have one of the following:
fr_ca: Lorsque les escaliers et les allées à gradins sont en ligne droite, les transitions doivent présenter l'une des caractéristiques suivantes :

source: Where a U-shaped kitchen is provided, clearances shall comply with Section 804.2.2.
fr_ca: Lorsqu'une cuisine en U est prévue, les dégagements doivent être conformes à la section 804.2.2.

source: Where a building fire alarm system is provided, the system wiring shall be extended to a point within the unit in the vicinity of the unit smoke detection system.
fr_ca: Lorsqu’un système d’alarme d'incendie du bâtiment est installé, le câblage du système doit être prolongé jusqu’à un point situé dans le logement, à proximité du système de détection de fumée du logement.

source: Where a building is equipped throughout with an automatic sprinkler system in accordance with Section 903.3.1.1 or 903.3.1.2, Class II materials are permitted in any area where Class I materials are required, and materials complying with DOC FF-1 “pill test” (CPSC 16 CFR Part 1630) or with ASTM D2859 are permitted in any area where Class II materials are required.
fr_ca: Lorsqu’un bâtiment est entièrement équipé d’un système d’extincteurs automatiques conformément à la section 903.3.1.1 ou 903.3.1.2, les matériaux de classe II sont autorisés dans toute zone où des matériaux de classe I sont requis, et les matériaux conformes à l’essai de pastille DOC FF-1 (CPSC 16 CFR, partie 1630) ou à la norme ASTM D2859 sont autorisés dans toute zone où des matériaux de classe II sont requis.

source: Where a building is equipped throughout with an automatic sprinkler system in accordance with Section 903.3.1.1, vertical openings for escalators shall be permitted where protected in accordance with Section 712.1.3.1 or 712.1.3.2.
fr_ca: Lorsque le bâtiment est entièrement équipé d’un système d’extincteurs automatiques conformément à la section 903.3.1.1, les ouvertures verticales destinées aux escaliers mécaniques sont autorisées lorsqu’elles sont protégées conformément à la section 712.1.3.1 ou 712.1.3.2.

source: Where a building or portion of a building is required to be accessible, at least one accessible route shall be provided to each portion of the building, to accessible building entrances connecting accessible pedestrian walkways and to the public way.
fr_ca: Lorsqu’un bâtiment ou une partie de bâtiment doit être accessible, au moins un itinéraire accessible doit être aménagé jusqu’à chaque partie du bâtiment, jusqu’aux entrées accessibles du bâtiment qui relient les parcours piétonniers accessibles et la voie publique.

source: Where a clear floor space is provided within the room beyond the arc of the door swing.
fr_ca: Lorsqu'une surface de plancher dégagée est prévue dans la pièce au-delà de l'arc d'ouverture de la porte.

source: Where a clear floor space, excluding knee and toe clearances under elements, is provided within the room beyond the arc of the door swing.
fr_ca: Lorsqu'une surface de plancher dégagée, à l'exclusion des espaces pour les genoux et les orteils sous les éléments, est prévue dans la pièce au-delà de l'arc d'ouverture de la porte.

source: Where a closed-circuit communication system is provided, the public or common-use system interface shall comply with Section 1106.6.1, and the unit system interface in units required to have communication features shall comply with Section 1106.6.2.
fr_ca: Lorsqu'un système de communication en circuit fermé est prévu, l'interface du système public ou à usage commun doit se conformer à la section 1106.6.1, et l'interface du système de l'unité dans les unités devant être dotées de fonctions de communication doit se conformer à la section 1106.6.2.

source: Where a day care facility is part of a dwelling unit, only the portion of the structure utilized for the day care facility is required to comply with this chapter.
fr_ca: Lorsqu’une garderie fait partie d’un logement, seule la partie de la construction utilisée pour la garderie doit être conforme au présent chapitre.

source: Where a door is provided as the required emergency escape and rescue opening, it shall be a swinging door or a sliding door.
fr_ca: Lorsqu'une porte est prévue comme ouverture d'évacuation et de sauvetage d'urgence exigée, il doit s'agir d'une porte battante ou d'une porte coulissante.

source: Where a door is provided on a long side and on a narrow end of a lift, the side door shall be located with either the strike side or the hinge side in the corner furthest from the door on the narrow end.
fr_ca: Lorsqu'une porte est prévue sur un côté long et sur une extrémité étroite d'un monte-personne, la porte latérale doit être située avec le côté de la gâche ou le côté de la charnière dans le coin le plus éloigné de la porte sur l'extrémité étroite.

source: Where a door or gate is adjacent to a ramp landing, maneuvering clearances required by Sections 404.2.3 and 404.3.4 shall be permitted to overlap the landing area.
fr_ca: Lorsqu'une porte ou un portillon est adjacent à un palier de rampe, les espaces de dégagement exigés par les articles 404.2.3 et 404.3.4 peuvent chevaucher la zone du palier.

source: Where a door or gate that is subject to locking is located adjacent to a ramp landing, the landing shall be sized to provide a turning space complying with Section 304.3.
fr_ca: Lorsqu'une porte ou un portail verrouillable est situé à côté d'un palier de rampe, le palier doit être dimensionné de manière à fournir un espace de rotation conforme à la section 304.3.

source: Where a floor level is not required to be connected by an accessible route, the only toilet rooms or bathing rooms provided within the facility shall not be located on the inaccessible floor.
fr_ca: Lorsqu'un niveau du sol ne doit pas être relié par un itinéraire accessible, les seules salles de toilette ou salles de bain prévues dans l'établissement ne doivent pas être situées à l'étage non accessible.

source: Where a floor, ceiling or wall has multiple surface finishes, the NRC x S product for each surface finish shall be added to the left side of the equation.
fr_ca: Lorsqu'un plancher, un plafond ou un mur a plusieurs finitions de surface, le produit NRC x S pour chaque finition de surface doit être ajouté au côté gauche de l'équation.

source: Where a food preparation area is provided on the entrance level, it shall comply with Section 1105.7.
fr_ca: Lorsqu'une zone de préparation des aliments est prévue au niveau de l'entrée, elle doit être conforme à la section 1105.7.

source: Where a forward approach is provided, the clearance shall be 66 inches (1675 mm) minimum in depth, measured perpendicular from the rear wall.
fr_ca: Lorsqu'une approche frontale est prévue, le dégagement doit avoir une profondeur minimale de 66 po [1675 mm], mesurée perpendiculairement au mur arrière.

source: Where a fuel-burning appliance is located within a bedroom or its attached bathroom, a carbon monoxide alarm shall be installed within the bedroom.
fr_ca: Lorsqu'un appareil à combustible est situé dans une chambre à coucher ou dans sa salle de bain attenante, un détecteur de monoxyde de carbone doit être installé dans la chambre à coucher.

source: Where a fuel-burning appliance is located within a bedroom or its attached bathroom, carbon monoxide detection shall be installed within the bedroom.
fr_ca: Lorsqu’un appareil à combustion est situé dans une chambre ou dans sa salle de bains attenante, la détection de monoxyde de carbone doit être installée dans la chambre.

source: Where a horizontal assembly is required by other Sections of this code, the assembly shall have a fire-resistance rating of not less than that required by that section.
fr_ca: Lorsqu'un l’ensemble horizontal est requis par d’autres sections du présent code, il doit présenter une résistance au feu d’au moins celle exigée par cette section.

source: Where a household carbon monoxide detection system is installed, it shall become a permanent fixture of the occupancy and owned by the homeowner.
fr_ca: Lorsqu'un système de détection de monoxyde de carbone domestique est installé, il doit devenir un élément permanent de l'occupation et appartenir au propriétaire.

source: Where a household fire alarm system is installed, it shall become a permanent fixture of the occupancy, owned by the homeowner.
fr_ca: Lorsqu'un système d'alarme incendie domestique est installé, il doit devenir un équipement permanent de l'occupation, appartenant au propriétaire.

source: Where a lavatory is provided in the compartment or room, provide a dispenser for soap.
fr_ca: Lorsqu'un lavabo est prévu dans le compartiment ou la pièce, il faut prévoir un distributeur de savon.

source: Where a lavatory is provided in the compartment or room, provide a hand towel dispenser or hand dryer complying with Table 603.6.
fr_ca: Lorsqu'un lavabo est prévu dans le compartiment ou la pièce, prévoir un distributeur de serviettes ou un sèche-mains conforme au Tableau 603.6.

source: Where a lining is not provided, the total minimum thickness of back and side walls shall be 10 inches (254 mm) of solid masonry.
fr_ca: Lorsqu'un revêtement n'est pas prévu, l'épaisseur minimale totale de la paroi arrière et des parois latérales doit être de 10 po [254 mm] de maçonnerie pleine.

source: Where a lining of firebrick not less than 2 inches (51 mm) thick or other approved lining is provided, the minimum thickness of back and sidewalls shall each be 8 inches (203 mm) of solid masonry, including the lining.
fr_ca: Lorsqu'un revêtement en brique réfractaire d'au moins 2 po [51 mm] d'épaisseur ou un autre revêtement approuvé est prévu, l'épaisseur minimale des parois arrière et latérales doit être de 8 po [203 mm] de maçonnerie pleine, incluant le revêtement.

source: Where a lining of firebrick not less than 2 inches (51 mm) thick, or a lining of vitrified clay not less than 5/8 inch (16 mm) thick, is provided, the total minimum thickness of front, back and side walls shall be 6 inches (152 mm) of solid masonry, including the lining.
fr_ca: Lorsqu'un revêtement en brique réfractaire d'au moins 2 po [51 mm] d'épaisseur ou un revêtement en argile vitrifiée d'au moins 5/8 po [16 mm] d'épaisseur est prévu, l'épaisseur minimale totale des murs avant, arrière et latéraux doit être de 6 po [152 mm] de maçonnerie pleine, incluant le revêtement.

source: Where a multistory unit is provided with external elevator service to only one floor, the floor provided with elevator service shall be the primary entry to the unit, shall comply with the requirements for a Type B unit and, where provided within the unit, a living area, a kitchen and a toilet facility shall be provided on that floor.
fr_ca: Lorsqu’un logement à plusieurs étages est desservi par un ascenseur extérieur à un seul étage, l’étage desservi par l’ascenseur doit constituer l’entrée principale du logement, être conforme aux exigences applicables à une unité de type B et, lorsqu’ils sont prévus dans le logement, comporter à cet étage une aire de séjour, une cuisine et des toilettes.

source: Where a panic bar is installed, such material shall be not less than 1 inch (25 mm) wide for the entire length of the actuating bar or touchpad.
fr_ca: Lorsqu'une barre anti-panique est installée, ce matériau doit avoir une largeur d'au moins 1 pouce (25 mm) sur toute la longueur de la barre d'actionnement ou du pavé tactile.

source: Where a pass-through kitchen is provided, clearances shall comply with Section 804.2.1.
fr_ca: Lorsqu'une cuisine avec passe-plat est prévue, les dégagements doivent être conformes à la section 804.2.1.

source: Where a permanent seat is provided at the head end of the bathtub, the clearance shall extend 12 inches (305 mm) minimum beyond the wall at the head end of the bathtub.
fr_ca: Lorsqu'un siège permanent est prévu à la tête de mur de la baignoire, le dégagement doit se prolonger d'au moins 12 po [305 mm] au-delà du mur à la tête de mur de la baignoire.

source: Where a permit is required, a fee for each permit shall be paid as required, in accordance with the schedule as established by the applicable governing authority.
fr_ca: Lorsqu’un permis est exigé, des frais doivent être payés pour chaque permis, conformément au barème établi par l’autorité compétente concernée.

source: Where a proscenium wall is required to have a fire-resistance rating, the stage opening shall be provided with a fire curtain complying with NFPA 80, horizontal sliding doors complying with Section 716 having a fire protection rating of not less than 1 hour, or an approved water curtain complying with Section 903.3.1.1 or, in facilities not utilizing the provisions of smoke-protected assembly seating in accordance with Section 1030.6.2, a smoke control system complying with Section 909 or natural ventilation designed to maintain the smoke level not less than 6 feet (1829 mm) above the floor of the means of egress.
fr_ca: Lorsqu’un mur de séparation de scène doit présenter une résistance au feu, l’ouverture de scène doit être munie d’un rideau coupe-feu conforme à la norme NFPA 80, de portes coulissantes horizontalement conformes à la section 716 et présentant un degré de résistance au feu d’au moins 1 heure, ou d’un rideau d’eau approuvé conforme à la section 903.3.1.1 ou, dans les établissements ne faisant pas appel aux dispositions relatives aux places assises protégées contre la fumée conformément à la section 1030.6.2, d’un système de contrôle des fumées conforme à la section 909 ou d’une ventilation naturelle conçue de manière à maintenir le niveau de fumée à au moins 6 pieds (1 829 mm) au-dessus du plancher du moyen d’évacuation.

source: Where a range, counter-mounted cooking unit, or sink is installed in an island or peninsular countertop and the depth of the countertop behind the range, counter-mounted cooking unit, or sink is less than 12 inches (305 mm), the range, counter-mounted cooking unit, or sink has divided the countertop space into two separate countertop spaces as defined in Section E3901.4.4.
fr_ca: Lorsqu'une cuisinière, une unité de cuisson montée sur le comptoir ou un évier est installé sur un îlot ou un comptoir en forme de péninsule et que la profondeur du comptoir derrière la cuisinière, l'unité de cuisson montée sur le comptoir ou l'évier est inférieure à 12 po [305 mm], la cuisinière, l'unité de cuisson montée sur le comptoir ou l'évier a divisé l'espace du comptoir en deux espaces de comptoir séparés, tels que définis à la section E3901.4.4.

source: Where a required interior exit stairway or ramp and an exit access stairway or ramp serve the same floor level and terminate at the same level of exit discharge, the termination of the exit access stairway or ramp and the exit discharge door of the interior exit stairway or ramp shall be separated by a distance of not less than 30 feet (9144 mm) or not less than one-fourth the length of the maximum overall diagonal dimension of the building, whichever is less.
fr_ca: Lorsque l’escalier ou la rampe d’issue intérieur exigé et l’escalier ou la rampe d’accès à l’issue desservent le même niveau d’étage et aboutissent au même niveau de l’issue, l’extrémité de l’escalier ou de la rampe d’accès à l’issue et la porte d’issue au niveau de l’issue de l’escalier ou de la rampe d’issue intérieur doivent être séparées par une distance d’au moins 30 pieds (9 144 mm) ou d’au moins le quart de la longueur de la plus grande dimension diagonale hors tout du bâtiment, selon la moindre de ces valeurs.

source: Where a rubbish chute extends through a building more than one floor below the lowest intake, the extension shall have sprinklers installed that are recessed from the drop area of the chute and protected from freezing in accordance with Section 903.3.1.1.
fr_ca: Lorsqu'un vide-ordures traverse un bâtiment sur plus d’un étage sous la prise la plus basse, le prolongement doit être muni d’extincteurs automatiques encastrés de manière à ne pas se trouver dans la zone de chute du vide-ordures et protégés contre le gel conformément à la section 903.3.1.1.

source: Where a sheet-applied, load-bearing, bonded, waterproof membrane is installed as the shower lining, the membrane shall not be required to be recessed.
fr_ca: Lorsqu'une membrane imperméable, collée, porteuse et appliquée en feuille est installée comme revêtement de douche, la membrane n'est pas tenue d'être encastrée.

source: Where a side wall is provided opposite the seat within 72 inches (1830 mm) of the seat wall a vertical grab bar shall be provided.
fr_ca: Lorsqu'une paroi latérale est prévue en face du siège à moins de 72 po [1830 mm] du mur du siège, une barre d'appui verticale doit être prévue.

source: Where a side wall is provided opposite the seat within 72 inches (1830 mm) of the seat wall, a grab bar shall be provided on the side-wall opposite the seat.
fr_ca: Lorsqu'une paroi latérale est prévue en face du siège à moins de 72 po [1830 mm] du mur du siège, il faut prévoir une barre d'appui sur la paroi latérale en face du siège.

source: Where a sign containing raised characters and braille is provided at double doors with one active leaf, the sign shall be located on the inactive leaf.
fr_ca: Lorsqu'un panneau contenant des caractères en relief et du braille est installé sur des portes doubles avec un battant actif, le panneau doit être situé sur le battant inactif.

source: Where a sign containing raised characters and braille is provided at double doors with two active leaves, the sign shall be to the right of the right-hand door.
fr_ca: Lorsqu'un panneau contenant des caractères en relief et du braille est prévu sur des portes doubles à deux vantaux actifs, le panneau doit être à droite de la porte de droite.

source: Where a sign language interpreter station is located with a permanent wall less than 10 feet (3050 mm) behind the sign language interpreter station, the permanent wall to a height of 96 inches (2440 mm) from the finish floor shall be considered as a backdrop.
fr_ca: Lorsqu'un poste d'interprète en langue des signes est situé avec un mur permanent à moins de 10 pi [3050 mm] derrière le poste d'interprète en langue des signes, le mur permanent jusqu'à une hauteur de 96 po [2440 mm] à partir du sol fini doit être considéré comme une toile de fond.

source: Where a single clear floor space positioned for parallel approach is provided between two beds, a clear floor space shall not be required on both sides of the bed.
fr_ca: Lorsqu'une seule surface de plancher dégagée positionnée pour un accès parallèle est prévue entre deux lits, une surface de plancher dégagée n'est pas exigée des deux côtés du lit.

source: Where a smoke compartment is adjoined by two or more smoke compartments, the minimum area of the refuge area shall accommodate the largest occupant load of the adjoining compartments.
fr_ca: Lorsqu’un compartiment coupe-fumée est adjacent à deux compartiments coupe-fumée ou plus, la superficie minimale de l’aire de refuge doit être suffisante pour accueillir la plus grande charge d’occupants des compartiments adjacents.

source: Where a stepped aisle is required to have two handrails, the mid-aisle handrails shall be discontinuous.
fr_ca: Lorsqu’une allée à gradins doit être munie de deux mains courantes, les mains courantes intermédiaires de l’allée doivent être discontinues.

source: Where a system permitting voice communication between a visitor and the occupant of the unit is provided at a location other than the unit entry door, the system shall comply with Section 1106.6.
fr_ca: Lorsqu’un système permettant une communication vocale entre un visiteur et l’occupant du logement est installé à un endroit autre que la porte d’entrée du logement, le système doit être conforme à la section 1106.6.
